okapi/app/controllers/dash_board_controller.rb

    def new
        @user = User.find_by(id: session[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1